Revit 2027 API
BuiltInFailures.GroupFailures.MembersMovedToProjectToMakeConsistent Property
 Group members had to be "moved to the project" (removed from their group instance) because they were not consistent with the group type definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MembersMovedToProjectToMakeConsistent { get; }
Public Shared ReadOnly Property MembersMovedToProjectToMakeConsistent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MembersMovedToProjectToMakeConsistent {
	FailureDefinitionId^ get ();
}
static member MembersMovedToProjectToMakeConsistent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace